<template>
  <div class="top">
    <the-header :needSearch="false"></the-header>
    <div class="totalPageBackground">
      <div class="columns is-mobile">
        <div class="column is-2"></div>
        <div class="box column is-8 boxBackground">
          <div>
            <h1 class="title">利用規約</h1>
          </div>
          この利用規約（以下，「本規約」といいます。）は私共が提供するこのサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。<br />
          ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って本サービスをご利用いただきます。<br />
          <div>
            <h1 class="title">第1条</h1>
          </div>
          本規約は，ユーザーが本サービスの利用に関わる一切の関係に適用されるものとします。<br />
          私共は本サービスに関し，本規約の他ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。<br />
          これら個別規定はその名称の如何に関わらず，本規約の一部を構成するものとします。<br />
          本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り個別規定の規定が優先されるものとします。<br />
          <div>
            <h1 class="title">第2条</h1>
          </div>
          ユーザーは，本サービスの利用にあたり以下の行為をしてはなりません。<br />
          1. 法令または公序良俗に違反する行為 犯罪行為に関連する行為<br />
          2.
          本サービスの内容等，本サービスに含まれる著作権，商標権ほか知的財産権を侵害する行為<br />
          3.
          私共，ほかのユーザー，またはその他第三者のサーバーまたはネットワークの機能を破壊，または妨害する行為<br />
          6. 私共のサービスの運営を妨害するおそれのある行為<br />
          7. 不正アクセスをし，またはこれを試みる行為<br />
          9. 不正な目的を持って本サービスを利用する行為<br />
          10.
          本サービスの他のユーザーまたはその他の第三者に不利益，損害，不快感を与える行為<br />
          12.
          私共が許諾しない本サービス上での宣伝，広告，勧誘，または営業行為<br />
          14.
          私共のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為<br />
          15. その他，私共が不適切と判断する行為<br />
          16.
          私共は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。<br /><br />
          本サービスにかかるコンピュータシステムの保守点検または更新を行う場合<br />
          地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合<br />
          コンピュータまたは通信回線等が事故により停止した場合<br />
          その他，私共が本サービスの提供が困難と判断した場合<br />
          私共は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。<br />
          <div>
            <h1 class="title">第3条</h1>
          </div>
          私共は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。<br />
          私共は，本サービスに起因してユーザーに生じたあらゆる損害について、一切の責任を負いません。<br />
          前項ただし書に定める場合であっても，私共は，私共の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（私共またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。<br />
          私共は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。<br />
          <div>
            <h1 class="title">第4条</h1>
          </div>
          私共は，ユーザーへ事前の告知無しに本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。<br />
          <div>
            <h1 class="title">第5条</h1>
          </div>
          私共は以下の場合には、ユーザーの個別の同意を要せず事前の通知無しに本規約を変更することができるものとします。<br />
          本規約の変更がユーザーの一般の利益に適合するとき。<br />
          本規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。<br />
          私共はユーザーに対し前項による本規約の変更にあたり、事前に本規約を変更する旨及び変更後の本規約の内容並びにその効力発生時期を通知します。<br />
          <div>
            <h1 class="title">第6条</h1>
          </div>
          本規約の解釈にあたっては，日本法を準拠法とします。<br />
          本サービスに関して紛争が生じた場合には，私共の本店所在地を管轄する裁判所を専属的合意管轄とします。<br />
        </div>
      </div>
      <div class="column is-2"></div>
    </div>
  </div>
</template>

<script>
import TheHeader from "~/components/TheHeader.vue";

export default {
  components: {
    TheHeader
  }
};
</script>

<style scoped>
.top {
  overflow: hidden;
}

.totalPageBackground {
  background-color: #f7ecde;
}

.boxBackground {
  background-color: #fbf8f1;
}
</style>
